In [2]:
import sqlite3

In [3]:
db = sqlite3.connect('IMDB.sqlite')
db

In [4]:
db = sqlite3.connect('IMDB_11.sqlite')
db

In [80]:
db = sqlite3.connect('School_1.sqlite')
db

In [39]:
cur = db.cursor()
cur

In [16]:
sql_query = 'Create table Student (RollNumber int Primary key,Name Text, Age int)'
cur.execute(sql_query)

In [19]:
insert_ =  'Insert into Student values(101,"Aman",20)'
cur.execute(insert_)

In [20]:
db.commit() # to save entry to db

In [22]:
cur.execute('Insert into Student values(103,"Shubham",21)')

In [23]:
db.commit()

In [24]:
db.close() # to close the connection

In [42]:
cur.execute('Insert into Student values(109,"Mohit",24)')
db.commit()

rollNumber = 107
name = "Raja"
age = 14

cur.execute('Inert into Student values(?,?,?)',(rollNumber,name,age))

In [45]:
rollNumber = 107
name = "Raja"
age = 14

cur.execute('Insert into Student values(?,?,?)',(rollNumber,name,age))
db.commit()

In [46]:
values = [(110,"Nidhi",20),(111,"Ankush",21)]
cur.executemany('Insert into Student values(?,?,?)',values)

In [47]:
db.commit()

In [48]:
cur.execute('update Student set age = 30')

In [49]:
db.commit()

In [51]:
cur.execute('Update Student set age = 20 where RollNumber = 110')

In [52]:
db.commit()

In [55]:
rows = cur.execute('Select * from Student')

In [56]:
for row in rows:
    print(row)

(101, 'Aman', 30)
(103, 'Shubham', 30)
(106, 'Mohit', 30)
(109, 'Mohit', 30)
(107, 'Raja', 30)
(110, 'Nidhi', 20)
(111, 'Ankush', 30)

In [57]:
rows = cur.execute('Select * from Student')

In [60]:
print(cur.fetchone())
print(cur.fetchone())

(106, 'Mohit', 30)
(109, 'Mohit', 30)

In [61]:
rows = cur.execute('Select * from Student')

In [62]:
print(cur.fetchmany(3))

[(101, 'Aman', 30), (103, 'Shubham', 30), (106, 'Mohit', 30)]

In [63]:
rows = cur.execute('Select * from Student')
print(cur.fetchmany())

[(101, 'Aman', 30)]

In [64]:
rows = cur.execute('Select * from Student')
print(cur.fetchall())

[(101, 'Aman', 30), (103, 'Shubham', 30), (106, 'Mohit', 30), (109, 'Mohit', 30), (107, 'Raja', 30), (110, 'Nidhi', 20), (111, 'Ankush', 30)]

In [65]:
rows = cur.execute('Select * from Student')
ans = (cur.fetchall())

In [66]:
ans

[(101, 'Aman', 30),
 (103, 'Shubham', 30),
 (106, 'Mohit', 30),
 (109, 'Mohit', 30),
 (107, 'Raja', 30),
 (110, 'Nidhi', 20),
 (111, 'Ankush', 30)]

In [67]:
rows = cur.execute('Select * from Student where RollNumber > 20')
print(cur.fetchall())

[(101, 'Aman', 30), (103, 'Shubham', 30), (106, 'Mohit', 30), (107, 'Raja', 30), (109, 'Mohit', 30), (110, 'Nidhi', 20), (111, 'Ankush', 30)]

In [68]:
rows = cur.execute('Select * from Student where Name like "A%"')
print(cur.fetchall())

[(101, 'Aman', 30), (111, 'Ankush', 30)]

In [70]:
pip install pandas

Collecting pandas
  Using cached pandas-1.1.5-cp38-cp38-macosx_10_9_x86_64.whl (10.1 MB)
Requirement already satisfied: numpy>=1.15.4 in /Users/shubhammalhotra/opt/anaconda3/lib/python3.8/site-packages (from pandas) (1.19.2)
Requirement already satisfied: pytz>=2017.2 in /Users/shubhammalhotra/opt/anaconda3/lib/python3.8/site-packages (from pandas) (2020.4)
Requirement already satisfied: python-dateutil>=2.7.3 in /Users/shubhammalhotra/opt/anaconda3/lib/python3.8/site-packages (from pandas) (2.8.1)
Requirement already satisfied: six>=1.5 in /Users/shubhammalhotra/opt/anaconda3/lib/python3.8/site-packages (from python-dateutil>=2.7.3->pandas) (1.15.0)
Installing collected packages: pandas
Successfully installed pandas-1.1.5
Note: you may need to restart the kernel to use updated packages.

In [71]:
# sqlite using pandas
import pandas as pd

data = pd.read_sql_query("Select * from Student",db)
data

   RollNumber     Name  Age
0         101     Aman   30
1         103  Shubham   30
2         106    Mohit   30
3         109    Mohit   30
4         107     Raja   30
5         110    Nidhi   20
6         111   Ankush   30

In [74]:
data[data['Age'] == 30]

   RollNumber     Name  Age
0         101     Aman   30
1         103  Shubham   30
2         106    Mohit   30
3         109    Mohit   30
4         107     Raja   30
6         111   Ankush   30

In [75]:
db.close()

In [78]:
data = pd.DataFrame([[201,'Aman','English',20000],[202,"komal","Maths",22000]],columns = ["ID","Name","Course","Salary"])
data

    ID   Name   Course  Salary
0  201   Aman  English   20000
1  202  komal    Maths   22000

In [81]:
data.to_sql("Faculty",db)

In [84]:

data = pd.read_sql_query("Select * from Student",db)
data["Address"] = "Test"
data

   RollNumber     Name  Age Address
0         101     Aman   30    Test
1         103  Shubham   30    Test
2         106    Mohit   30    Test
3         109    Mohit   30    Test
4         107     Raja   30    Test
5         110    Nidhi   20    Test
6         111   Ankush   30    Test

In [87]:
data.to_sql("Student",db,if_exists='replace') # to update the db